KanatERPSukhova.КанатАдаптация/src/Catalogs/КАНАТ_БлокиДоговоров/КАНАТ_БлокиДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КАНАТ_БлокиДоговоров</name>
  <comment>Справочник для сохранения текстов шаблонов договоров</comment>
  <attributes>
    <name>ХранилищеТабДокумента</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСвойОбработчик</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбработчикЗаполнения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполнениеПодразделениями</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/КАНАТ_БлокиДоговоров/Forms/ФормаЭлемента/Module.bsl
//БИТ_Байков ++ 16.08.23·#2_4_Конструктор договоров
&НаКлиенте
Процедура ИспользоватьСвойОбработчикПриИзменении(Элемент)
	Элементы.ОбработчикЗаполнения.Видимость = Объект.ИспользоватьСвойОбработчик;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ОбработчикЗаполнения.Видимость = Объект.ИспользоватьСвойОбработчик;  
		ПолучитьИзХранилища();
		ЭтотОбъект.Ширина = 175;  
		ЗаполнитьПодсказку()
	КонецПроцедуры              
	
	&НаСервере
Процедура ЗаполнитьПодсказку()  
		
		Если Объект.ОбработчикЗаполнения = "" Тогда
			Объект.ОбработчикЗаполнения = 
			"//Если в шаблоне договора вы добавили свои параметры, например [МойДопПараметр1],[МойПараметр2],[ДобавленыйПараметр3], [ФИОРодительном]
			|//то необходимо в обработчике указать правила их заполнения.
			|//Пример заполнения нестандартными параметрами:
			|//ПараметрыЗаполнения.МойДопПараметр1 = ""Нужный в договоре текст"";
			|//ПараметрыЗаполнения.МойПараметр2 = ТекущаяДата();
			|//ПараметрыЗаполнения.ДобавленыйПараметр3 = Пользователи.ТекущийПользователь();
			|//ПараметрыЗаполнения.ФИОРодительном = СклонениеПредставленийОбъектов.ПросклонятьФИО(Объект.Менеджер, 2)
			|//-- Рабочий код необходимо писать без обратных слэшей. Текущий пример можно удалить.";
		КонецЕсли;
		
		ОписаниеПараметров = 
		"[НомПП] - Номер раздела по порядку среди добавленных разделов договора
		|
		|//////////////////////////////////////////////////////
		|Названия доступных параметров, которые будут заполнены данными из договора
		|//////////////////////////////////////////////////////
		|";
		Для каждого Реквизит Из Метаданные.Справочники.ДоговорыКонтрагентов.Реквизиты Цикл
			ОписаниеПараметров = ОписаниеПараметров +"[Договор"+ Реквизит.Имя +"]"+ " - " + Реквизит.Синоним+";"+ Символы.ПС;
		КонецЦикла;
		
		ОписаниеПараметров = ОписаниеПараметров+
		"
		|
		|
		|//////////////////////////////////////////////////////
		|Названия доступных параметров, которые будут заполнены данными из Контрагента
		|//////////////////////////////////////////////////////
		|";
		Для каждого Реквизит Из Метаданные.Справочники.Контрагенты.Реквизиты Цикл
			ОписаниеПараметров = ОписаниеПараметров +"[Контрагент"+ Реквизит.Имя +"]"+ " - " + Реквизит.Синоним+";"+ Символы.ПС;
		КонецЦикла;  
		
		ОписаниеПараметров = ОписаниеПараметров+
		" 
		|[КонтрагентРегистрационныйНомер] - ОГРН Контрагента;  
		|[НаименованиеПолноеСРасшифровкой] - Наименование с заменой ООО, ИП, АО на полные наименования, если они стоят первыми в строке;
		|[НаименованиеПолноеСРасшифровкойРодительныйПадеж] - Наименование с заменой ООО, ИП, АО на полные наименования, если они стоят первыми в строке в родительном падеже;
		|[КонтрагентЮрАдрес] - Юридический Адрес Контрагента;
		|[КонтрагентEmail] - Email Контрагента;
		|[КонтрагентФактАдрес] - Фактический Адрес Контрагента;
		|[КонтрагентФакс] - Факс Контрагенты;
		|[КонтрагентТелефон] - Телефон Контрагента;
		|[КонтрагентПочтовыйАдрес] - Почтовый Адрес Контрагента;
		|[КонтрагентМеждународныйАдрес] - Международный Адрес Контрагента;
		|[КонтрагентДругаяИнформация] - Другая Информация Контрагенты
		|[ДоговорКонтактноеЛицоРодительный] - Контактное лицо клиента из договора в родительном падеже;
		|[ДоговорКонтактноеЛицоИнициалы] - Контактное лицо клиента из договора с сокращением имени и отчества;  
		|[ДоговорКонтактноеЛицоДолжностьРодительный] - Должность по визитке в родительном падеже;
		|";   
        Для каждого Реквизит Из Метаданные.Справочники.КонтактныеЛицаПартнеров.Реквизиты Цикл
			ОписаниеПараметров = ОписаниеПараметров +"[ДоговорКонтактноеЛицо"+ Реквизит.Имя +"]"+ " - " + Реквизит.Синоним+";"+ Символы.ПС;
		КонецЦикла;
		
		ОписаниеПараметров = ОписаниеПараметров+
		"
		|//////////////////////////////////////////////////////
		|Названия доступных параметров, которые будут заполнены данными из Банковского счета Контрагента
		|//////////////////////////////////////////////////////
		|";
		Для каждого Реквизит Из Метаданные.Справочники.БанковскиеСчетаКонтрагентов.Реквизиты Цикл
			ОписаниеПараметров = ОписаниеПараметров +"[КонтрагентБСчет"+ Реквизит.Имя +"]"+ " - " + Реквизит.Синоним+";"+ Символы.ПС;
		КонецЦикла;
			
		
		ОписаниеПараметров = ОписаниеПараметров+
		"
		|
		|
		|//////////////////////////////////////////////////////
		|Названия доступных параметров, которые будут заполнены данными из Соглашения с контрагентом
		|//////////////////////////////////////////////////////
		|";
		Для каждого Реквизит Из Метаданные.Справочники.СоглашенияСКлиентами.Реквизиты Цикл
			ОписаниеПараметров = ОписаниеПараметров +"[Соглашение"+ Реквизит.Имя +"]"+ " - " + Реквизит.Синоним+";"+ Символы.ПС;
		КонецЦикла;
		
		ОписаниеПараметров = ОписаниеПараметров+
		"
		|
		|
		|//////////////////////////////////////////////////////
		|Названия доступных параметров, которые будут заполнены данными Организации
		|//////////////////////////////////////////////////////
		|[ОрганизацияЮрАдрес] - Юридический Адрес Организации;
		|[ОрганизацияEmail] - Email Организации;
		|[ОрганизацияФактАдрес]  - Фактический Адрес Организации;
		|[ОрганизацияФакс] - Факс Организации;
		|[ОрганизацияТелефон] - Телефон Организации;
		|[ОрганизацияПочтовыйАдрес] - Почтовый Адрес Организации;
		|[ОрганизацияМеждународныйАдрес]  - Международный Адрес Организации;
		|[ОрганизацияДругаяИнформация] - Другая Информация Организации;  ";
		
		
		ОписаниеПараметров = ОписаниеПараметров+
		"
		|
		|//////////////////////////////////////////////////////
		|Названия доступных параметров, которые будут заполнены данными из Банковского счета организации
		|//////////////////////////////////////////////////////
		|";
		Для каждого Реквизит Из Метаданные.Справочники.БанковскиеСчетаОрганизаций.Реквизиты Цикл
			ОписаниеПараметров = ОписаниеПараметров +"[БСчет"+ Реквизит.Имя +"]"+ " - " + Реквизит.Синоним+";"+ Символы.ПС;
		КонецЦикла;
		
		//БИТ_Гурьев__18.12.24++
		ОписаниеПараметров = ОписаниеПараметров+
		"
		|
		|//////////////////////////////////////////////////////
		|Названия доступных параметров, которые будут заполнены данными Организации
		|//////////////////////////////////////////////////////
		|";
		Для каждого Реквизит Из Метаданные.Справочники.Организации.Реквизиты Цикл
			ОписаниеПараметров = ОписаниеПараметров +"[Организация"+ Реквизит.Имя +"]"+ " - " + Реквизит.Синоним+";"+ Символы.ПС;
		КонецЦикла;
		//БИТ_Гурьев__18.12.24--

	КонецПроцедуры
	

&НаСервере
Процедура ПолучитьИзХранилища()
    Если ЗначениеЗаполнено(Объект.ссылка) Тогда
		ОбъектСправочник = Объект.Ссылка.ПолучитьОбъект();
	 	ТабДокумент = ОбъектСправочник.ХранилищеТабДокумента.Получить(); 
	Иначе 
		ТабДокумент = Справочники.КАНАТ_БлокиДоговоров.ПолучитьМакет("МакетБезЗаполнения");
	КонецЕсли;       
	
	//ТабДокумент.Область(1,1,ТабДокумент.ВысотаСтраницы,ТабДокумент.ШиринаСтраницы).Заполнение = ТипЗаполненияОбластиТабличногоДокумента.Шаблон;

 КонецПроцедуры

&НаСервере
 Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ХранилищеТабДокумента = Новый ХранилищеЗначения(ТабДокумент); 
 КонецПроцедуры
